#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg]
data.azurerm_key_vault.kv: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05MzE4MjkwMS1jZGU2LTRmMGQtOGQ1Mi00YTg2ZjZlNzg5MzA7b2JqZWN0SWQ9ZGYzNTY1ZGMtNDEzZC00NmY1LTg2OTUtOTAyNjFlYjA0ZmUyO3N1YnNjcmlwdGlvbklkPTNmZTM0YzdkLTg0ODYtNGZmZi1hZDEwLWEzYWZjMGNmMDliNTt0ZW5hbnRJZD1mN2YxNmFjMS1jZWNiLTQzODMtYjAxMS04Y2ViZmI5OWUwYmE=]
azurerm_network_security_group.nsg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-win-nsg1]
azurerm_virtual_network.vnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-win-vnet]
azurerm_public_ip.nic1_ip: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/publicIPAddresses/lt-tf-win-ip1]
data.azurerm_key_vault.kv: Read complete after 1s [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-dev-terraform/providers/Microsoft.KeyVault/vaults/lt-dev-kv1]
data.azurerm_key_vault_secret.kv_secret: Reading...
azurerm_subnet.subnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-win-vnet/subnets/lt-tf-win-subnet]
azurerm_subnet.bastion_subnet: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-win-vnet/subnets/AzureBastionSubnet]
azurerm_subnet_network_security_group_association.nsg1_subnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-win-vnet/subnets/lt-tf-win-subnet]
azurerm_bastion_host.bastion: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/bastionHosts/lt-tf-win-bastion]
azurerm_network_interface.nic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-win-nic1]
data.azurerm_key_vault_secret.kv_secret: Read complete after 1s [id=https://lt-dev-kv1.vault.azure.net/secrets/win-vm1-password/9eda50e83b5c42dbac81453148131d1a]
azurerm_windows_virtual_machine.windows-vm: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-win-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-win-vm1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_automation_account.automation_acc will be created
  + resource "azurerm_automation_account" "automation_acc" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "norwayeast"
      + name                          = "lt-tf-win-auto-account"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "lt-tf-win-rg"
      + sku_name                      = "Basic"
    }

  # azurerm_automation_credential.example will be created
  + resource "azurerm_automation_credential" "example" {
      + automation_account_name = "lt-tf-win-auto-account"
      + id                      = (known after apply)
      + name                    = "DomainAdmin"
      + password                = (sensitive value)
      + resource_group_name     = "lt-tf-win-rg"
      + username                = "win-admin"
    }

  # azurerm_automation_dsc_configuration.win_adds will be created
  + resource "azurerm_automation_dsc_configuration" "win_adds" {
      + automation_account_name = "lt-tf-win-auto-account"
      + content_embedded        = <<-EOT
            Configuration DC1
            {
            	$domainCred = Get-AutomationPSCredential -Name "DomainAdmin"
                $DomainName = Get-AutomationVariable -Name "DomainName"
                $DomainDN = Get-AutomationVariable -Name "DomainDN"
            	
            	# Import the modules needed to run the DSC script
                Import-DscResource -ModuleName 'PSDesiredStateConfiguration'
            	Import-DScResource -ModuleName 'ComputerManagementDsc'
            	Import-DscResource -ModuleName 'ActiveDirectoryDsc'	
            
            	Node "Localhost"
            	{
            	    Computer NewComputerName
                    {
                        Name = "DC1"
                    }       	
            		
            		WindowsFeature ADDSInstall
            		{
            			Ensure = "Present"
            			Name = "AD-Domain-Services"
            			DependsOn = "[Computer]NewComputerName"
            		}
            		WindowsFeature ADDSTools
            		{
            			Ensure = "Present"
            			Name = "RSAT-ADDS"
            		}
            		WindowsFeature InstallRSAT-AD-PowerShell
            		{
            			Ensure = "Present"
            			Name = "RSAT-AD-PowerShell"
            		}
            		
            		ADDomain $DomainName
                    {
                        DomainName                    = $DomainName
                        Credential                    = $domainCred
                        SafemodeAdministratorPassword = $domainCred
            			ForestMode                    = 'WinThreshold'
            			DependsOn 					  = "[WindowsFeature]ADDSInstall"
                    }	
            		WaitForADDomain $DomainName
                    {
                        DomainName           = $DomainName
            			WaitTimeout          = 600
            			RestartCount         = 2
                        PsDscRunAsCredential = $domainCred
                    }
            		ADOrganizationalUnit 'Demo'
                    {
                        Name                            = "Demo"
                        Path                            = "$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "TopLevel OU"
                        Ensure                          = 'Present'
                    }
            		
            		ADOrganizationalUnit 'WebServers'
                    {
                        Name                            = "WebServers"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "WebServers OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}
            		ADOrganizationalUnit 'Administration'
                    {
                        Name                            = "Administration"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "Administration OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}
            		ADOrganizationalUnit 'AdminUsers'
                    {
                        Name                            = "AdminUsers"
                        Path                            = "OU=Administration,OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "Administration OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Administration"
            		}
            		ADOrganizationalUnit 'ServiceAccounts'
                    {
                        Name                            = "ServiceAccounts"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "ServiceAccounts OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}
            		ADOrganizationalUnit 'Citrix'
                    {
                        Name                            = "Citrix"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "Citrix OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}		
            		ADOrganizationalUnit 'Users'
                    {
                        Name                            = "Users"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "Users OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}
            		ADOrganizationalUnit 'Servers'
                    {
                        Name                            = "Servers"
                        Path                            = "OU=Demo,$domainDN"
                        ProtectedFromAccidentalDeletion = $true
                        Description                     = "Servers OU"
            			Ensure                          = 'Present'
            			DependsOn 						= "[ADOrganizationalUnit]Demo"
            		}		
            		ADUser	 'test123'
            		{
            			UserName = 'test123'
            			Description = "Test account"
            			Credential = $Cred
            			PasswordNotRequired = $true
            			DomainName = 'larzytech.com'
            			Path = "OU=ServiceAccounts,OU=Demo,$domainDN"
            			Ensure = 'Present'
            			DependsOn = "[ADOrganizationalUnit]ServiceAccounts"
            			Enabled = $true
            			UserPrincipalName = "test123@larzytech.com"
            			PasswordNeverExpires = $true
            			ChangePasswordAtLogon = $false
            		}		
            	}
            }
        EOT
      + id                      = (known after apply)
      + location                = "norwayeast"
      + log_verbose             = false
      + name                    = "win_adds_dsc"
      + resource_group_name     = "lt-tf-win-rg"
      + state                   = (known after apply)
    }

  # azurerm_automation_module.addsc will be created
  + resource "azurerm_automation_module" "addsc" {
      + automation_account_name = "lt-tf-win-auto-account"
      + id                      = (known after apply)
      + name                    = "ActiveDirectoryDsc"
      + resource_group_name     = "lt-tf-win-rg"

      + module_link {
          + uri = "https://devopsgallerystorage.blob.core.windows.net/packages/activedirectorydsc.6.2.0.nupkg"
        }
    }

  # azurerm_automation_module.compdsc will be created
  + resource "azurerm_automation_module" "compdsc" {
      + automation_account_name = "lt-tf-win-auto-account"
      + id                      = (known after apply)
      + name                    = "ComputerManagementDsc"
      + resource_group_name     = "lt-tf-win-rg"

      + module_link {
          + uri = "https://devopsgallerystorage.blob.core.windows.net/packages/computermanagementdsc.9.0.0.nupkg"
        }
    }

  # azurerm_automation_module.psdsc will be created
  + resource "azurerm_automation_module" "psdsc" {
      + automation_account_name = "lt-tf-win-auto-account"
      + id                      = (known after apply)
      + name                    = "PSDesiredStateConfiguration"
      + resource_group_name     = "lt-tf-win-rg"

      + module_link {
          + uri = "https://devopsgallerystorage.blob.core.windows.net/packages/psdesiredstateconfiguration.2.0.6.nupkg"
        }
    }

  # azurerm_automation_variable_string.DomainDN will be created
  + resource "azurerm_automation_variable_string" "DomainDN" {
      + automation_account_name = "lt-tf-win-auto-account"
      + encrypted               = false
      + id                      = (known after apply)
      + name                    = "DomainDN"
      + resource_group_name     = "lt-tf-win-rg"
      + value                   = "CN=larzytech,DN=com"
    }

  # azurerm_automation_variable_string.DomainName will be created
  + resource "azurerm_automation_variable_string" "DomainName" {
      + automation_account_name = "lt-tf-win-auto-account"
      + encrypted               = false
      + id                      = (known after apply)
      + name                    = "DomainName"
      + resource_group_name     = "lt-tf-win-rg"
      + value                   = "larzytech.com"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larstthorsen, Action: `pull_request`*